{
  "url": "https://www.vetsforthe.net",
  "siteTitle": "Vets for the Net",
  "siteDescription": "Veterans support net neutrality",
  "shareTitle": "OPEN LETTER: Veterans are demanding *REAL* net neutrality protections",
  "shareDescription": "US veterans are calling on Congress to defend online freedom",
  "shareImage": "https://www.vetsforthe.net/images/social/Veterans.jpg",
  "facebookShareURL": "https://shpg.org/103/188950/facebook",
  "twitterShareURL": "https://shpg.org/103/188951/twitter",
  "googleAnalyticsId": "UA-26576645-50",
  "actionNetworkPetitionId": "908c16ac-00a1-4f2c-9194-f03540f39ed7",
  "letterToCongress": "Dear Member of Congress,\n\nWe are US veterans calling on our elected officials in Congress to protect the free and open internet. Veterans, military families, and service members rely on the Internet to keep in touch with loved ones overseas and access essential services at home. The open Internet allows American small businesses to thrive, and has created new jobs &mdash; in the tech field and others &mdash; that veterans urgently need.\n\nThe loss of net neutrality will allow cable companies to throttle services to online communities used by service members, censor free speech, and charge new fees that veterans can’t afford. The end of net neutrality jeopardizes access to VA telemedicine, streaming video calls, even online banking &mdash; all services veterans and our families rely on.\n\nAs veterans, we have served and we have sacrificed. When we put on the uniform we were told it was to defend basic freedoms for all. We are deeply concerned those same freedoms will not be protected without strong, enforceable net neutrality. As a result, we are asking our representatives to sign the discharge petition and vote for the Congressional Review Act (CRA) resolution to reverse the FCC’s repeal and restore open Internet protections that are essential for American’s online freedom.\n\nThank you for considering our views.\n\nSincerely,\n\nThe undersigned.",
  "signatureCount": 10,
  "counterValue": 3149,
  "logos": [
    {"img": "fftf.png", "alt": "Fight for the Future"},
    {"img": "centerformediajustice.png", "alt": "Center for Media Justice"}
  ]
}
