{
  "url": "https://www.vetsforthe.net",
  "siteTitle": "Vets for the Net",
  "siteDescription": "Veterans support net neutrality",
  "shareTitle": "OPEN LETTER: Veterans are demanding *REAL* net neutrality protections",
  "shareDescription": "Our military service members have served and sacrificed to protect our freedom ... now they're fighting for our freedom online.",
  "shareImage": "https://www.vetsforthe.net/images/social/Veterans.jpg",
  "facebookShareURL": "https://shpg.org/103/188950/facebook",
  "twitterShareURL": "https://shpg.org/103/188951/twitter",
  "googleAnalyticsId": "UA-26576645-48",
  "actionNetworkPetitionId": "94ac8142-99b8-411f-83af-133d02649af1",
  "letterToCongress": "Dear Member of Congress,\n\nWe are US veterans calling on our elected officials in Congress to protect the free and open internet. Veterans, military families, and service members rely on the Internet to keep in touch with loved ones overseas and access essential services at home. The open Internet allows American small businesses to thrive, and has created new jobs - in the tech field and others - that veterans urgently need.\n\nThe loss of net neutrality will allow cable companies to throttle services to online communities used by service members, censor free speech, and charge new fees that veterans can’t afford. The end of net neutrality jeopardizes access to VA telemedicine, Skype and WhatsApp, even online banking - all services veterans and our families rely on.\n\nAs veterans, we have served our country proudly and made sacrifices to protect free speech. We are deeply concerned that free speech online will no longer be protected by net neutrality. As a result, we are asking our representatives to sign the discharge petition and vote for the Congressional Review Act (CRA) resolution to reverse the FCC’s repeal and restore net neutrality protections that are essential for American’s online freedom.\n\nThank you for considering our views.\n\nSincerely,\n\nThe undersigned.
  "signatureCount": 10
}
