[
  {
    "text": "As a US Navy veteran who deployed from my family numerous times, I cannot emphasize enough the importance of being able to connect via the internet with loved ones at home.  Please act to repeal the FCC decision to roll back net nutrality rules and keep an open and fair internet for our service members and their family.",
    "source": "Robert York, Navy Veteran",
    "link": ""
  },
    {
    "text": "Corporate influence in Congress has corrupted the values I lost my legs for, and the situation with net neutrality is one of the most blatant examples. This needs to change. That can start by honoring net neutrality.",
    "source": "Adrian Simone, Marine Corps Veteran",
    "link": ""
  },
  {
    "text": "USAF, Desert Storm era. I know firsthand what a vital tool the Internet is for veterans, and particularly when it comes to those deployed overseas, it becomes literally a lifeline. The net should be treated as traffic-neutral; any other method is simply not sustainable and flies in the face of the Internet's design.",
    "source": "Kelly Luck, Air Force Veteran",
    "link": ""
  },
  {
    "text": "I work in the IT industry as well as being an Army veteran and I am extremely disappointed that the FCC has abdicated its responsibility to protect American citizens from abuse by major Internet Service Providers. I respectfully demand that Congress take action to reverse the FCC decision to remove Title 2 oversight of Internet Service Providers.",
    "source": "Chris Prescott, Army Veteran",
    "link": ""
  },
  {
    "text": "As a proud veteran of the USMC, I strongly support net neutrality backed by Title 2 oversight of ISPs. Corporations should have no right to restrict or favor any internet traffic over another. In contrast to the lies of Ajit Pai we have seen corporations such as Verizon, Comcast and others attempt to do just that prior to the previous net neutrality laws (which did not go far enough to protect the internet). Please do what we we elected you to do and represent the American people in this and not lobbyists for corporations.",
    "source": "Eldon Alameda, Marine Corps Veteran",
    "link": ""
  },
  {
    "text": "When I served to defend The Land of the Free, I never imagined an Internet.  I'd like to think that Freedom could be applied to the internet, though.  My nephew is now serving and he relies on his daily contact with his wife and two young sons.  For ONCE please start thinking beyond your precious Bottom Line and the donors to whom you are probably beholden.  Think of those who serve.  And serve THEM for a change.",
    "source": "Clifford Niven, Army Veteran",
    "link": ""
  },
  {
    "text": "I served 4 in the Corps for our freedoms, and not for a corporation. Please restore Net Neutrality!!",
    "source": "Craig Rose, Marine Corps Veteran",
    "link": ""
  },
  {
    "text": "I, and all of the veterans served (or continue to serve) to protect our country and our Constitution. As we served honorably, I now ask you to honorably serve us by defeating the loss of net neutrality.",
    "source": "Robert Jones, Navy Veteran",
    "link": ""
  },
  {
    "text": "I wore the uniform of my country for nearly 24 years and never intended for the benefits of that service to be limited to wealthy fellow citizens.",
    "source": "Larry Holdman",
    "link": ""
  },
  {
    "text": "Disgraceful. Is THIS what we risked our lives for? For big and fancy people and business control what the little people can and can't do? If I would've known this would happen I wouldn't have signed up. Screw YOU Ajit Pai! And Trump? What the hell, man? I VOTED for you! Next time you better count my ass out!",
    "source": "James Walter",
    "link": ""
  },
  {
    "text": "Net neutrality, in my eyes is upheld by the 1st amendment, freedom of speach. If the FCC has the right to block, charge extra or even limit what we are exposed to, that is an infringement on our rights as american citizens. I, as a vet am completely appalled by the government to even let this be considered.",
    "source": "Marcus Gioia",
    "link": ""
  },
  {
    "text": "Net neutrality is tantamount to freedom of speech. Anyone who tries to interfere with one of the most fundamental of American rights is a traitor. Once again, American values are being sold to corporate interests by those that are supposed to representing the citizens.",
    "source": "Jackie Critser",
    "link": ""
  },
  {
    "text": "An open internet is the technological keystone to freedom of speech.",
    "source": "Brian McKinley, Army Veteran",
    "link": ""
  },
  {
    "text": "Free exchange of ideas as the Constitution permits is just a part what we were serving to protect.",
    "source": "Raymond C. Bryan",
    "link": ""
  },
  {
    "text": "Net neutrality shouldn't be a partisan idea.  It's the right answer for the future of the internet.  Do the right thing.",
    "source": "Michael Hoyt, Marine Corps Veteran",
    "link": ""
  },
  {
    "text": "This hurts aging vets who have to live on small fixed incomes.",
    "source": "Carl Fussell, Army",
    "link": ""
  },
  {
    "text": "As a US Veteran, I strongly support net neutrality backed by Title 2 oversight of ISPs. Come on FCC &mdash; this is COMMON SENSE. Abolishing net neutrality legislation has the potential to take away freedom of speech to American Citizens due to ISPs being able to control the speeds at which we receive our information.",
    "source": "David Habisohn, Air Force Veteran",
    "link": ""
  },
  {
    "text": "I am a disabled veteran. I use things such as Facebook and LinkedIn to keep in touch with my battle buddies in North Carolina. Please reverse the FCC repeal of net neutrality",
    "source": "Forrest Perez, Army Veteran",
    "link": ""
  },
  {
    "text": "I am without words to express how betrayed I feel...  the country I love so much, and would give my life defending, is handing our digital freedom to the service providers. Our only voice against their cable monopolies was cutting the cord. When that finally started to make a difference, they came for the internet... and the FCC gave it to them! ",
    "source": "Tom Bennard, Army Veteran",
    "link": ""
  },
  {
    "text": "You’re constantly putting money in pockets that don’t struggle and taking more and more from pockets who do.  This is another example.  Striking down net neutrality is going to allow money hungry giants to continue to feed on hard working Americans.  It might even hurt those who are trying to further their education.  I support my President, but I do not support all his decisions and this is one of those I don’t.",
    "source": "Andy Klotz, Army Veteran",
    "link": ""
  },
  {
    "text": "As an educator, the thought of an individual being able to slow down, limit or restrict access to information based on their personal beliefs is terrifying. As a Gunnery Sergeant in the Marines it is a slap in the face to all those whom fight to protect the constitution from all enemies, foreign and domestic, and they are spitting on the graves of all those who died to protect the same.",
    "source": "Luis Garcia, Marine Corps Veteran",
    "link": ""
  },
  {
    "text": "Drain the swamp!  End political appointment of corporate shills.  (Yes, I'm talking about you, Ajit Pai.)",
    "source": "Glen Neff, Army Veteran",
    "link": ""
  },
  {
    "text": "Vietnam-era Navy Hospital Corpsman, retired educator, who values access to a wide range of information and opinions, and doesn't want corporate control over what I can learn.",
    "source": "David Casker, Navy Veteran",
    "link": ""
  },
  {
    "text": "The internet is what makes it possible for me to take care of my family's needs while deployed.  Communication, banking, bill paying, even the administration of deployments themselves require internet.  There are plenty of cases where corporations screw over those in uniform, so many places where a service is denied just because I put on the uniform.  It needs to stop.  Bring back real internet protections for those of us that really need them through Title 2 oversight.",
    "source": "Edward S. Savich, Navy Veteran",
    "link": ""
  },
  {
    "text": "I’m a home bound disabled VN Veteran and rely on the neutrality of the Internet every day of my life.  It is my only connection to the outside world.  Repealing net neutrality only benefits the bottom line of ISPs, telecom networks, and big business in general.  The Internet is every bit as necessary to me and everyday citizens as natural gas, electricity, water which without question classifies the Internet as a utility.  DO NOT REPEAL NET NEUTRALITY!",
    "source": "Paul Levin, Army Veteran",
    "link": ""
  },
  {
    "text": "Breaking net neutrality is an attack on the American values of free speech; my oath, even retired, demands that I oppose these actions.  Reinstitute net neutrality!",
    "source": "Victor B. Putz, Jr., Air Force Veteran",
    "link": ""
  },
  {
    "text": "This is a no-brainer to everyone who is not a telecom lobbyist.",
    "source": "Matthew Twomey, Army Veteran",
    "link": ""
  },
  {
    "text": "I work from home and my company does not reimburse my internet costs.  Ending net neutrality will surely impact my cost of service and will jeopardize my ability to stay working for the company I've been employed for 19 years.  Not to mention the other negative implications to average Americans.  Please reverse the FCC's ill-advised ruling.",
    "source": "Justin Singmaster, Army Veteran",
    "link": ""
  },
  {
    "text": "Couldn't agree more, I signed up to defend freedom not what some faceless corporation determines what my freedom will be.  Freedom is Freedom.",
    "source": "Bill Deboer, Marine Corps Veteran",
    "link": ""
  },
  {
    "text": "We've seen what happens when big business is given free reign. It consumes without thought or conscience. Now it threatens to consume communication and information that people need to stay informed &mdash; a form of freedom I as a military member swore to protect. Return to net neutrality.",
    "source": "Lorrianne Arwood, Air Force Veteran",
    "link": ""
  },
  {
    "text": "I fought for an America of individual choice not corporate monopoly. Restore Net Neutrality!",
    "source": "William Lingenfelter, Army Veteran",
    "link": ""
  },
  {
    "text": "Please don't let this be another way that our government lets down veterans. Stand for what you know is right.",
    "source": "Jennifer Welling",
    "link": ""
  },
  {
    "text": "I am a veteran who is in school for Information Technology. The loss of net neutrality has not done anything to improve the internet access. It will only damage the infrastructure of US internet as prices for connections increase without any improvements to speed. As a veteran whos future income is tied to high internet speeds without data caps, this is a large concern.",
    "source": "James W. Bryant, Marine Corps Veteran",
    "link": ""
  },
  {
    "text": "We need open access to the internet. The private sector did not create the internet ... they need to keep their hands and profit seeking off the need. we need open communication without interference!",
    "source": "Thomas Unthank, Army Veteran",
    "link": ""
  },
  {
    "text": "Open free speech is not a commercial commodity. It is lifeline to all whether it is to promote commerce or family communications. The FCC ruling censors that by allowing providers control over access. That is wrong. Those in the service of this country rely on open communication with loves ones.",
    "source": "John L. Aponick",
    "link": ""
  }
  {
    "text": "I am an Army Signal Corps veteran who worked at a Detroit non-profit (now retired) to provide computer training, technology and connectivity to the under-served of our community in an effort to bridge the Digital Divide.  The loss of Net Neutrality cripple those efforts to provide low income folks the access to very vital digital communication.",
    "source": "Anthony Semanik, Army Veteran",
    "link": ""
  },
  {
    "text": "Please don't take away net neutrality. Not being able to use the services of unfettered internet while on deployment will be a nightmare for those deployed and their families.",
    "source": "Thomas Garrett, Air Force Veteran",
    "link": ""
  }
  {
    "text": "As a U.S. veteran, the freedom of the Internet has meant everything to me. It belongs to everyone in the form it started. Some gave all, and some served longer but at 21+ years I would not want it tampered with by the politicians, the FCC and big business billionaire companies that paid them to disrupt and/or take away one more of the freedoms that we enjoy as United States citizens.",
    "source": "Eric Bollin, Army Veteran",
    "link": ""
  },
  {
    "text": "I expect this to be a top priority for my representatives.  If it is not they will not get my vote in their next re-election.",
    "source": "Rebecca Griswold, Navy Veteran",
    "link": ""
  },
  {
    "text": "I was always told the airwaves were owned by the people and leased to corporations. If that is in fact true, then we the people should have a say in how & to whom they are leased. Just because our govt. dropped the ball on 9/11 should not mean we the people should pay an indefinite price for their mistake. It is past time that the American people should have a say in what is rightfully theirs. Net neutrality should be the law, not net monopoly.",
    "source": "Gordon LeMons, Marine Corps Veteran",
    "link": ""
  },
  {
    "text": "Taking away net neutrality is a red flag to me and probably  to many in our country that our democracy is slipping away and that the profit and power of the elite is more important than the welfare and dignity of the citizens of this country. Please send the right message this time to your constituents and restore net neutrality. It will go a long way in helping to restore the trust we have in our government !",
    "source": "Marty E. Levin, Army Veteran",
    "link": ""
  },
  {
    "text": "I stood up for freedom when my country needed me, now I need my country to stand up for freedom. Protect Net Neutrality, please.",
    "source": "Pat Taber, Army Veteran",
    "link": ""
  },
  {
    "text": "I feel that this Net Neutrality is a very important issue, and that our Congress have dropped the ball on it...they should have fought for the rights of the people, not corporations!",
    "source": "Brant Pfister, Army Veteran",
    "link": ""
  },
  {
    "text": "I'm very disappointed that I'll have to tell my grandchildren that I fought in a war so that the US could stay involved in politics in the middle east, but all I did to preserve one of the most American things about us (free internet) was sign a stupid petition. Please do something. Nothing worse than a bunch of pissed off military service members.",
    "source": "Tim Barber, Marine Corps Veteran",
    "link": ""
  }
]
