[
  {
    "text": "USAF, Desert Storm Era. I know firsthand what a vital tool the Internet is for veterans, and particularly when it comes to those deployed overseas, it becomes literally a lifeline. The net should be treated as traffic-neutral; any other method is simply not sustainable and flies in the face of the Internet's design.",
    "source": "Kelly Luck",
  },
  {
    "text": "I strongly support net neutrality backed by Title 2 oversight of ISPs. As a veteran, I am appalled that our government has sold out to big businesses, denying the people the very rights and privileges granted under our Constitution.",
    "source": "Christopher from NC",
    "link": "https://www.fcc.gov/ecfs/filing/1214690405860"
  },
	{
    "text": "A veteran of the USA Here (12B10 Army). I strongly support net neutrality backed by Title 2 oversight of ISPs. The internet is a way for people like me to access our medical information through the VA online. I use Facebook to talk to my family and old squadmates.",
    "source": "Blantz from OH",
    "link": "https://www.fcc.gov/ecfs/filing/12131461620706"
  },
  {
    "text": "As a US Veteran, I strongly support net neutrality backed by Title 2 oversight of ISPs.  Come on FCC &mdash; this is COMMON SENSE. Abolishing net neutrality legislation has the potential to take away freedom of speech to American Citizens due to ISPs being able to control the speeds at which we receive our information.",
    "source": "Nathaniel from AZ",
    "link": "https://www.fcc.gov/ecfs/filing/1214011516300"
  },
  {
    "text": "As a registered voter and USAF veteran (1985-1989), I strongly support Net Neutrality backed by Title 2 oversight of ISPs.",
    "source": "Scott from CA",
    "link": "https://www.fcc.gov/ecfs/filing/12141984028513"
  },
  {
    "text": "As a veteran and someone who has made sacrifices for his country, I find Commissioner Ajit Pai's actions dishonerable. He acts as a lobbyist and should not be allowed to decide my freedoms then collect the royalties when he returns to Verizon.",
    "source": "Jesse from VA",
    "link": "https://www.fcc.gov/ecfs/filing/12140178807694"
  },
  {
    "text": "Protect American Liberties and freedom of information. Do not sell out our rights to the free and open flow of information to a narrow band of corporate interests. A well-informed electorate is the cornerstone of a democracy. Selling the right to access information for the sake of profit is FASCIST and Un-American. I am a Disabled Veteran...and I VOTE!",
    "source": "Vito from TX",
    "link": "https://www.fcc.gov/ecfs/filing/1221309811701"
  },
  {
    "text":  "As a Veteran of the United States Army, I strongly support net neutrality backed by Title 2 oversight of ISPs.",
    "source": "Angela from MI",
    "link": "https://www.fcc.gov/ecfs/filing/12140592922893"
  }
]
